# ./Brewfile

tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask"
tap "homebrew/core"

brew 'bat'
brew 'brew-cask-completion'
brew 'coreutils'
brew 'deno'
brew 'emacs'
brew 'exa'
brew 'ffmpeg'
brew 'gh'
brew 'gibo'
brew 'git'
brew 'gpg'
brew 'imagemagick'
brew 'jq'
brew 'mas'
brew 'peco'
brew 'pup'
brew 'stow'
brew 'switchaudio-osx'
brew 'tig'
brew 'tldr'
brew 'volta'
brew 'zsh-autosuggestions'
brew 'zsh-completions'

cask 'discord'
cask 'font-ricty-diminished'
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'krisp'
cask 'lyrics-master'
cask 'macx-dvd-ripper-pro'
cask 'microsoft-edge'
cask 'microsoft-teams'
cask 'raycast'
cask 'visual-studio-code'
cask 'zoom'

mas "AmorphousDiskMark", id: 1168254295
mas "Apple Configurator 2", id: 1037126344
mas "Compressor", id: 424390742
mas "Final Cut Pro", id: 424389933
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Meeter Zoom, Teams & Co.のために。", id: 1510445899
mas "Motion", id: 434290957
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "TweetDeck", id: 485812721
mas "Xcode", id: 497799835
